#include "STC15F2K60S2.H"   
#define uchar unsigned char
#define uint  unsigned int

uint j=0;
sbit beep=P3^4;

uint reset[15]={0,1908,1701,1515,1433,1276,1136,1012,956,852,759,716,638,568,506};	     // c调低音与中音1-7 对应的定时器重装值 
              //0   1    2    3    4    5    6    7    1  2   3   4   5   6   7  
xdata uchar music[204]={0,2, 10,1, 10,1, 10,1, 10,1, 12,1, 12,3, 0,4, 0,2, 9,1, 9,1, 10,1, 9,1.5, 0,7.5, 0,2, 8,1, 8,1, 8,1, 8,1, 8,1, 10,2, 10,1, 10,1, 11,2, 10,3,
                        0,8, 8,1, 8,1, 9,1, 8,1, 9,2, 0,2, 8,1, 8,2, 6,1, 6,1, 5,3, 0,8, 9,1, 9,1, 10,1, 11,1, 11,2, 0,2, 9,1, 8,1, 10,1, 9,0.5, 9,2, 0,6,
					    10,1, 10,1, 10,1, 10,1, 12,1, 12,3, 0,4, 10,1, 10,1, 12,1, 12,2,  10,1.5, 0,6, 8,1, 8,1, 8,1, 8,1, 8,1, 10,2, 10,1, 0,1, 10,1, 10,1, 10,2, 10,1,
					    10,1, 11,1, 10,4, 0,6,  8,1, 8,1, 9,1, 8,1, 8,2, 6,1.5, 8,1,  8,2, 6,1, 5,3, 0,5, 9,1, 9,1, 10,1, 11,1, 11,2, 0,1, 10,1, 9,1, 8,1,10,1, 9,1  };
			                             //乐谱 格式为一个音调加持续的时长的组合

void timer0() interrupt 1
{
	beep=~beep;
}


void delay(uint t)		                //延时函数	延时 t ms
{									   
	uint z;  
	for(;t>0;t--)   
    	for(z=800;z>0;z--) 
		;									
}

void play()
{
	if(reset[music[j]]!=0)			     //读取到不为0的某音调时，改变定时器0的初值，从而发出对应频率的方波给蜂鸣器
	{
	TR0=1;								 
	TH0=(65536-reset[music[j]])/256;
	TL0=(65536-reset[music[j]])%256;
	}
	else{TR0=0;}						 
	delay(180*music[++j]);               //延迟某音调对应的时长
	TR0=0;
	delay(60*music[j]);					 //乐谱中组合之间的小延迟
	j++;
    if(j==204)							 //唱完歌后延迟5s 继续唱该歌曲
	{j=0;delay(5000);}
}

main()
{	
    P3M0=0x10;							  //推挽输出
	P3M1=0x00;
    EA=1;								  //开启定时器中断
    ET0=1;
	TR0=1;
	beep=0;
	while(1){play();}
}

